app/views/subcategories/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."subcategory_id" = 1
---
<div class='container'>
     <% Item.where(subcategory_id: @subcategory).in_groups_of(6, false).each do |group| %>